Revit 2027 API
InitialIlluminanceIntensity.Distance Property
 The illuminance intensity distance value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; set; }
Public Property Distance As Double
	Get
	Set
public:
property double Distance {
	double get ();
	void set (double value);
}
member Distance : float with get, set
Property Value
Double
 The illuminance distance value in feet as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The distance value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace